In [1]:
import pandas as pd

In [2]:
pip install pyarrow

Requirement already satisfied: pyarrow in c:\users\priya\anaconda3\lib\site-packages (21.0.0)
Note: you may need to restart the kernel to use updated packages.

### RealTime UseCase 1 : Read a CSV file and Convert to Parquet format

In [3]:
"""
RealTime UseCase - 1
File Conversion LOC from csv to parquet
"""

df = pd.read_csv("car_crash.csv")
df.to_parquet("car_crash.parquet", engine = "pyarrow", index = False)

# One-Liner script
#pd.read_csv("car_crash.csv").to_parquet("car_crash.parquet", engine = "pyarrow", index = False)

### RealTime UseCase 2 : Create a DataFrame

In [4]:
"""
RealTime UseCase - 2
Creating dummy DataFrame and appending derived column to created DataFrame
Copy to another Dataframe
"""

#Creating new dataframe
data = {
    "id" : [1,2,3,4,5,6,7,8],
    "ename" : ["xx","yy","zz","aa","bb","cc","dd","ff"]
}

df_new = pd.DataFrame(data)
df_new.head()

   id ename
0   1    xx
1   2    yy
2   3    zz
3   4    aa
4   5    bb

In [5]:
#Appending derived column to existin dataframe
df_new["age"] = [30,30,30,30,45,56,67,45]
df_new.head()

   id ename  age
0   1    xx   30
1   2    yy   30
2   3    zz   30
3   4    aa   30
4   5    bb   45

In [6]:
#Appending column to existing dataframe with same values in all rows
df_new["salary"] = 50000
df_new.head()

   id ename  age  salary
0   1    xx   30   50000
1   2    yy   30   50000
2   3    zz   30   50000
3   4    aa   30   50000
4   5    bb   45   50000

In [7]:
#Copy to another Dataframe
df_replica = df_new.copy()
df_replica.head()

   id ename  age  salary
0   1    xx   30   50000
1   2    yy   30   50000
2   3    zz   30   50000
3   4    aa   30   50000
4   5    bb   45   50000

### RealTime UseCase 3 : Inspect Data

In [8]:
#First 5 records
df_replica.head()

   id ename  age  salary
0   1    xx   30   50000
1   2    yy   30   50000
2   3    zz   30   50000
3   4    aa   30   50000
4   5    bb   45   50000

In [9]:
#Last 5 records
df_replica.tail()

   id ename  age  salary
3   4    aa   30   50000
4   5    bb   45   50000
5   6    cc   56   50000
6   7    dd   67   50000
7   8    ff   45   50000

In [10]:
#(rows,colums)
df_replica.shape

(8, 4)

In [11]:
#schema & datatype
df_replica.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      8 non-null      int64
 1   ename   8 non-null      object
 2   age     8 non-null      int64
 3   salary  8 non-null      int64
dtypes: int64(3), object(1)
memory usage: 384.0+ bytes

In [12]:
#summary stats
df_replica.describe(include="all").T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
id,8.0,NaN,NaN,NaN,4.5,2.44949,1.0,2.75,4.5,6.25,8.0
ename,8,8,xx,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
age,8.0,NaN,NaN,NaN,41.625,14.212042,30.0,30.0,37.5,47.75,67.0
salary,8.0,NaN,NaN,NaN,50000.0,0.0,50000.0,50000.0,50000.0,50000.0,50000.0

In [13]:
#column names
df_replica.columns

Index(['id', 'ename', 'age', 'salary'], dtype='object')

In [14]:
#datatypes
df_replica.dtypes

id         int64
ename     object
age        int64
salary     int64
dtype: object

### RealTime UseCase 4 : Select Data

In [15]:
#Single columns
df_replica["id"]

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
Name: id, dtype: int64

In [16]:
#Multiple columns - Use double brace for multi column selection
df_replica[["id","ename"]]

   id ename
0   1    xx
1   2    yy
2   3    zz
3   4    aa
4   5    bb
5   6    cc
6   7    dd
7   8    ff

In [17]:
#First row by index position
df_replica.iloc[2]

id            3
ename        zz
age          30
salary    50000
Name: 2, dtype: object

In [18]:
# first row (by label/index)
df_replica.loc[2]

id            3
ename        zz
age          30
salary    50000
Name: 2, dtype: object

In [19]:
# cell at (row=0, col=1)
df_replica.iloc[3, 1]

'aa'

### RealTime UseCase 5 : Filter rows

In [20]:
#Filter employess whose age is 30 and view their details
print(df_replica[df_replica["age"]==30])

   id ename  age  salary
0   1    xx   30   50000
1   2    yy   30   50000
2   3    zz   30   50000
3   4    aa   30   50000

In [21]:
#Multiple conditions
print(df_replica[(df_replica["age"]==30) & (df_replica["id"]==1)])

   id ename  age  salary
0   1    xx   30   50000

### RealTime UseCase 6 : Sort Data

In [22]:
df_replica = df_replica.sort_values(by="age", ascending=False)
print(df_replica)

   id ename  age  salary
6   7    dd   67   50000
5   6    cc   56   50000
4   5    bb   45   50000
7   8    ff   45   50000
0   1    xx   30   50000
1   2    yy   30   50000
2   3    zz   30   50000
3   4    aa   30   50000

### RealTime UseCase 7 : Drop Data

In [23]:
# drop column
df_replica = df_replica.drop("salary", axis=1)
print(df_replica)

   id ename  age
6   7    dd   67
5   6    cc   56
4   5    bb   45
7   8    ff   45
0   1    xx   30
1   2    yy   30
2   3    zz   30
3   4    aa   30

In [24]:
# drop rows by index
df_replica = df_replica.drop([0, 1], axis=0)
print(df_replica)

   id ename  age
6   7    dd   67
5   6    cc   56
4   5    bb   45
7   8    ff   45
2   3    zz   30
3   4    aa   30

In [25]:
# drop rows based on condition
df_replica = df_replica.drop(df_replica[df_replica["age"]==45].index)
print(df_replica)

   id ename  age
6   7    dd   67
5   6    cc   56
2   3    zz   30
3   4    aa   30

### RealTime UseCase 8 : Merge/Join

In [26]:
# merge 2 datasets and bring both id and age columns from right dataframe
df_merged = pd.merge(df_new,df_replica[["id","age"]], on = "id", how = "inner")
df_merged

   id ename  age_x  salary  age_y
0   3    zz     30   50000     30
1   4    aa     30   50000     30
2   6    cc     56   50000     56
3   7    dd     67   50000     67

Note : Since "id" is the key column, it will not be duplicated in merged resultset

### RealTime UseCase 9 : Apply custom function

In [27]:
df_replica["age_group"] = df_replica["age"].apply(lambda x: "young" if x < 40 else "old")
df_replica

   id ename  age age_group
6   7    dd   67       old
5   6    cc   56       old
2   3    zz   30     young
3   4    aa   30     young

### RealTime UseCase 10 : Concat new record to existing dataframe

In [28]:
new_rows = pd.DataFrame(
    [
        {"id": 5, "ename": "bb", "age": 34},
        {"id": 8, "ename": "dd", "age": 32}
    ]
)

df_replica = pd.concat([df_replica, new_rows], ignore_index=True)

In [29]:
df_replica

   id ename  age age_group
0   7    dd   67       old
1   6    cc   56       old
2   3    zz   30     young
3   4    aa   30     young
4   5    bb   34       NaN
5   8    dd   32       NaN

 ### RealTime UseCase 11 : Handle missing data

In [30]:
#Check missing values
df_replica.isnull().sum()

id           0
ename        0
age          0
age_group    2
dtype: int64

In [31]:
#Fill missing values
df_replica.fillna("NA")

   id ename  age age_group
0   7    dd   67       old
1   6    cc   56       old
2   3    zz   30     young
3   4    aa   30     young
4   5    bb   34        NA
5   8    dd   32        NA

### RealTime UseCase 12 : Aggregations

In [39]:
car_df = pd.read_csv("car_crash.csv")
car_df.head()

,Unnamed: 0,dvcat,weight,Survived,airbag,seatbelt,frontal,sex,ageOFocc,yearacc,yearVeh,abcat,occRole,deploy,injSeverity,caseid
0,0,55+,27.078,Not_Survived,none,none,1,m,32,1997,1987.0,unavail,driver,0,4.0,2:13:2
1,1,25-39,89.627,Not_Survived,airbag,belted,0,f,54,1997,1994.0,nodeploy,driver,0,4.0,2:17:1
2,2,55+,27.078,Not_Survived,none,belted,1,m,67,1997,1992.0,unavail,driver,0,4.0,2:79:1
3,3,55+,27.078,Not_Survived,none,belted,1,f,64,1997,1992.0,unavail,pass,0,4.0,2:79:1
4,4,55+,13.374,Not_Survived,none,none,1,m,23,1997,1986.0,unavail,driver,0,4.0,4:58:1

## Keynotes: 1 Difference Between `axis=1` vs `axis=0` in Pandas

### Sample Dataset:

```
   A  B  C
0  1  2  3
1  4  5  6
```

---

### Example 1: `df.sum(axis=0)`

```python
df.sum(axis=0)
```

#### Output:
```
A     5   ← (1 + 4)
B     7   ← (2 + 5)
C     9   ← (3 + 6)
```

This performs sum moving **vertically along rows**

---

### Example 2: `df.sum(axis=1)`

```python
df.sum(axis=1)
```

#### Output:
```
0     6   ← (1 + 2 + 3)
1    15   ← (4 + 5 + 6)
```

This performs sum moving **horizontally across columns**

---

### Summary:

- `axis=0` → operates **down the rows** (column-wise calculation)
- `axis=1` → operates **across the columns** (row-wise calculation)

Use `axis` carefully depending on the direction in which you want the function to be applied.

In [40]:
# Note : axis = 1 is column wise representation. axis = 0 is row wise representation. For instance 
car_df = car_df.drop("Unnamed: 0", axis = 1) 

car_df.head()

,dvcat,weight,Survived,airbag,seatbelt,frontal,sex,ageOFocc,yearacc,yearVeh,abcat,occRole,deploy,injSeverity,caseid
0,55+,27.078,Not_Survived,none,none,1,m,32,1997,1987.0,unavail,driver,0,4.0,2:13:2
1,25-39,89.627,Not_Survived,airbag,belted,0,f,54,1997,1994.0,nodeploy,driver,0,4.0,2:17:1
2,55+,27.078,Not_Survived,none,belted,1,m,67,1997,1992.0,unavail,driver,0,4.0,2:79:1
3,55+,27.078,Not_Survived,none,belted,1,f,64,1997,1992.0,unavail,pass,0,4.0,2:79:1
4,55+,13.374,Not_Survived,none,none,1,m,23,1997,1986.0,unavail,driver,0,4.0,4:58:1

In [41]:
car_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11217 entries, 0 to 11216
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   dvcat        11217 non-null  object
 1   weight       11217 non-null  float64
 2   Survived     11217 non-null  object
 3   airbag       11217 non-null  object
 4   seatbelt     11217 non-null  object
 5   frontal      11217 non-null  int64
 6   sex          11217 non-null  object
 7   ageOFocc     11217 non-null  int64
 8   yearacc      11217 non-null  int64
 9   yearVeh      11217 non-null  float64
 10  abcat        11217 non-null  object
 11  occRole      11217 non-null  object
 12  deploy       11217 non-null  int64
 13  injSeverity  11140 non-null  float64
 14  caseid       11217 non-null  object
dtypes: float64(3), int64(4), object(8)
memory usage: 1.3+ MB

In [53]:
# Calculate Average of ageOFocc group by sex and add the result to existing dataframe
car_df['ageOFocc avg']= (
    car_df
    .groupby("sex")
    ['ageOFocc'].mean()
)

car_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11217 entries, 0 to 11216
Data columns (total 16 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   dvcat         11217 non-null  object
 1   weight        11217 non-null  float64
 2   Survived      11217 non-null  object
 3   airbag        11217 non-null  object
 4   seatbelt      11217 non-null  object
 5   frontal       11217 non-null  int64
 6   sex           11217 non-null  object
 7   ageOFocc      11217 non-null  int64
 8   yearacc       11217 non-null  int64
 9   yearVeh       11217 non-null  float64
 10  abcat         11217 non-null  object
 11  occRole       11217 non-null  object
 12  deploy        11217 non-null  int64
 13  injSeverity   11140 non-null  float64
 14  caseid        11217 non-null  object
 15  ageOFocc avg  0 non-null      float64
dtypes: float64(4), int64(4), object(8)
memory usage: 1.4+ MB

## Keynotes : 2 `reset_index()`

### - Without `reset_index()`

```python
car_df_agg = car_df.groupby("sex")["ageOFocc"].mean()
print(car_df_agg)
```

**Output** (Pandas **Series** with index = `sex`):

```yaml
sex
F    33.0
M    42.0
Name: ageOFocc, dtype: float64
```

- The result is a **Series**
- `sex` becomes the **index**
- `ageOFocc` is the aggregated value

---

### - With `reset_index()`

```python
car_df_agg = car_df.groupby("sex")["ageOFocc"].mean().reset_index()
print(car_df_agg)
```

**Output** (Pandas **DataFrame** with default integer index):

```r
  sex  ageOFocc
0   F      33.0
1   M      42.0
```

- The result is a **DataFrame**
- `sex` is a **regular column**
- Default row indices `0, 1, ...` are used

---

### When to use `reset_index()`?

Use `.reset_index()` when:
- You want a **clean DataFrame** (e.g., for plotting, exporting, or merging).
- You don’t want `sex` to act as the index.

Without it:
- The result is fine for **quick checks or printing**, but can be **less flexible** for downstream operations.

### RealTime UseCase 13 : Date Conversions